app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"